app/controllers/photos_controller.rb

  def index

    uri = URI('https://api.instagram.com/v1/tags/obama/media/recent?access_token=33228722.18b244b.1997064779cd4939bc2c91caabcecbe1')
    http = Net::HTTP.new(uri.host, uri.port)
    http.use_ssl = true
    http.verify_mode = OpenSSL::SSL::VERIFY_NONE # You should use VERIFY_PEER in production
    request = Net::HTTP::Get.new(uri.request_uri)
    res = http.request(request)

    response = JSON.parse(res.body)['data']
    response.each do |r|
      @newPhotos = Photo.new

      @newPhotos.image_full = r['images']['standard_resolution']['url']
      @newPhotos.image_thumbnail = r['images']['thumbnail']['url']
      @newPhotos.username = r['user']['username']
      @newPhotos.fullname = r['user']['full_name']
      @newPhotos.caption = r['caption']['text']
      @newPhotos.link = r['link']
      @newPhotos.profile_picture = r['user']['profile_picture']
      @newPhotos.created_time = r['created_time']
      @newPhotos.like_count = r['likes']['count']
      @newPhotos.comment_count = r['comments']['count']

      @newPhotos.save!
    end

    @photos = Photo.all
---
INSERT INTO "photos" ("image_full", "image_thumbnail", "username", "fullname", "caption", "link", "profile_picture", "created_time", "like_count", "comment_count", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
SELECT "photos".* FROM "photos"